benchmarks/OpenFOAM/2D/standingCapillaryWave/Cases/mycCartesian/mlpCurvature/fine/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;
boundaryField
{
    walls
    {
      //type            fixedFluxPressure;
	type            zeroGradient;
    }
    left
    {
      type            cyclic;
    }
    right
    {
        type            cyclic;
	}
    /*frontAndBack
    {
        type            empty;
	}*/
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }

}


// ************************************************************************* //
