benchmarks/OpenFOAM/2D/standingCapillaryWave/Cases/mycCartesian/mlpCurvature/fine/system/curvatureDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object curvatureDict;
}

curvatureModel mlpCurvature;

heightFunctionParams
{
  nMax 3;
} 	//SymMLP

mlpParams
{
  mlpModel "../../../../../mlpCurvatureModels/SymMLP";
  interfaceTol 0.001;
  zonalModel yes;
  useScaling yes;
  xoffsetInput 0;
  gainInput 2;
  yminInput -1;
  yminOutput 0.0;
  gainOutput 1.0;
  xoffsetOutput 0.0;
} 	// ************************************************************************* //

